import { Description } from '../models/description.model';

export const DESCRIPTION_DATA: Description = {
  header:
    'Профессиональный тестировщик с большим опытом в банковской сфере, специализирующийся на обеспечении качества сложных финансовых продуктов. Моя карьера началась с технической поддержки и работе в поддерже ДБО, что дало глубокое понимание пользовательских сценариев и бизнес-процессов, а затем плавно перетекла в тестирование. Обладаю комплексным подходом к QA: от ручного тестирования интерфейсов и логики до построения эффективных фреймворков автоматизации.',

  items: [
    {
      item: 'Полный цикл тестирования банковских продуктов: Опыт тестирования как фронтенда (веб-интерфейсы, UX/UI), так и бэкенда (API). Тестировал мобильные и web приложения как для физических лиц, так и для бизнеса.',
    },
    {
      item: 'Практический опыт автоматизации на двух стеках: Для мобильных приложений (Android): Kotlin + Kaspresso. Для веб-приложений (PWA) и API: TypeScript + Playwright.',
    },
    {
      item: 'Запуск автотестов с нуля: Ключевое достижение — реализация проекта автоматизации на Playwright "с чистого листа" в команде из двух человек. Результат — масшатибируемый проект со всеми необходимыми фичами. А также покрытие автотестами в 35%, что значительно повысило скорость регрессионного тестирования и стабильность продукта.',
    },
    {
      item: 'API-тестирование и документация: Опыт создания и поддержки коллекций запросов в Postman и их автоматизации.',
    },
    {
      item: 'Глубокое понимание предметной области: Благодаря опыту в банковской сфере, технической поддержке ДБО и дальнейшей работе QA.',
    },
    {
      item: 'Владение полным стеком инструментов QA: глубокое практическое знание всего спектра инструментов для обеспечения качества: работа с базами данных (SQL), анализ и модификация сетевого трафика (Charles Fiddler), использование TMS (TestRail, TestIT, X_RAY), GIT, CI/CD. А также владение принципами тест-дизайна и ведения документации.',
    },
  ],

  footer:
    'Мой интерес — участие в проектах, где можно применить комплексный подход к качеству: от аналитики требований и ручного исследовательского тестирования до внедрения и поддержки надежных автоматизированных решений.',
};
